import Nav from "../components/Nav/Nav";
import MainLayout from "../layout/MainLayout";
import Button from "../components/Button/Button";
import Info from "../components/Info/Info";
import styles from '../styles/Home.module.css'

export default function Home() {
  return (
    <MainLayout>
      <Nav/>
      <div className={styles.container}>
        <div className={styles.banner}>
          Привет, Я frontend разработчик из Уфы!
        </div>
        <div>
          <Info/>
        </div>
        <div className={styles.about}>
          <h2>Обо мне</h2>
          <p>
            Я занимаюсь веб-разработкой с 2017 года. В основном занимаюсь
            фронтендом, но и изучаю и практикую программирование на JavaScript.
            Разрабатываю интерактивные страницы с помощью React.js, неплохо
            знаком с SSR (Next/Nuxt).
          </p>
          <p>
            Использую Git в своей работе. Так же есть опыт работы в команде.
          </p>
          <p>
            Постоянно совершенствую свои навыки, изучаю фреймворки, пробую
            различные технологии и углубляю свои фундаментальные знания в
            области веб-разработки и мобильных приложений.
          </p>
        </div>
        <div className={styles.btnWrapper}>
          <Button url="/works" title="Мои работы"/>
        </div>
        <div className={styles.about}>
          <h2>Биография</h2>
          <div className={styles.row}>
            <span>2017</span>Начал изучать HTML, CSS, jQuery. Через пару месяцев
            был принят в компанию по разработке игры. В компании занимался
            разработкой промо сайта игры
          </div>
          <div className={styles.row}>
            <span>2018</span>Первый офис. Первый проект для клиентов. Устроился
            на работу в местную компанию по разработке сайтов на UMI.CMS и
            Bitrix "Интернет Решения"
          </div>
          <div className={styles.row}>
            <span>2019</span>Фриланс. Изучение JavaScript, React.js
          </div>
          <div className={styles.row}>
            <span>2020</span>Устроился в местную компанию по разработке сайтов
            "Вебпространство", разрабатывал сайты на Bitrix, Next.js, Vue.js
          </div>
          <div className={styles.row}>
            <span>2021</span>Фриланс. Изучение React Native
          </div>
        </div>
        <div className={styles.about}>
          <h2>Связь со мной</h2>
          <div className={styles.social}>
            <a href="https://github.com/jesorstaff">
              <svg stroke="currentColor" fill="currentColor" strokeWidth="0" viewBox="0 0 512 512" height="16" width="16" xmlns="http://www.w3.org/2000/svg">
                <path fill="#2c7a7b" d="M256 32C132.3 32 32 134.9 32 261.7c0 101.5 64.2 187.5 153.2 217.9a17.56 17.56 0 003.8.4c8.3 0 11.5-6.1 11.5-11.4 0-5.5-.2-19.9-.3-39.1a102.4 102.4 0 01-22.6 2.7c-43.1 0-52.9-33.5-52.9-33.5-10.2-26.5-24.9-33.6-24.9-33.6-19.5-13.7-.1-14.1 1.4-14.1h.1c22.5 2 34.3 23.8 34.3 23.8 11.2 19.6 26.2 25.1 39.6 25.1a63 63 0 0025.6-6c2-14.8 7.8-24.9 14.2-30.7-49.7-5.8-102-25.5-102-113.5 0-25.1 8.7-45.6 23-61.6-2.3-5.8-10-29.2 2.2-60.8a18.64 18.64 0 015-.5c8.1 0 26.4 3.1 56.6 24.1a208.21 208.21 0 01112.2 0c30.2-21 48.5-24.1 56.6-24.1a18.64 18.64 0 015 .5c12.2 31.6 4.5 55 2.2 60.8 14.3 16.1 23 36.6 23 61.6 0 88.2-52.4 107.6-102.3 113.3 8 7.1 15.2 21.1 15.2 42.5 0 30.7-.3 55.5-.3 63 0 5.4 3.1 11.5 11.4 11.5a19.35 19.35 0 004-.4C415.9 449.2 480 363.1 480 261.7 480 134.9 379.7 32 256 32z" />
              </svg>
              <span>@jesorstaff</span>
            </a>
            <br />
            <a href="https://t.me/Timagood">
              <svg width="16" height="16" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill="#2c7a7b" fillRule="evenodd" clipRule="evenodd" d="M48 24C48 37.2548 37.2548 48 24 48C10.7452 48 0 37.2548 0 24C0 10.7452 10.7452 0 24 0C37.2548 0 48 10.7452 48 24ZM16.0715 21.8015C13.6673 22.8512 11.1971 23.9298 8.93825 25.174C7.75877 26.0376 9.32638 26.6485 10.7971 27.2215C11.0309 27.3126 11.2622 27.4027 11.4797 27.4927C11.6607 27.5484 11.8447 27.607 12.0312 27.6664C13.6669 28.1875 15.4907 28.7686 17.0787 27.8945C19.6873 26.396 22.149 24.6636 24.6089 22.9325C25.4148 22.3653 26.2205 21.7983 27.0311 21.2397C27.0691 21.2154 27.1119 21.1876 27.1588 21.1573C27.8493 20.7096 29.4024 19.7029 28.8279 21.0901C27.4695 22.5757 26.0144 23.8907 24.5515 25.213C23.5655 26.1041 22.5759 26.9985 21.6099 27.9505C20.7686 28.6341 19.8949 30.0088 20.837 30.9661C23.0069 32.4851 25.2107 33.9673 27.4132 35.4487C28.1299 35.9307 28.8466 36.4127 29.5618 36.8959C30.774 37.8637 32.6685 37.0808 32.935 35.5685C33.0535 34.8728 33.1725 34.1772 33.2915 33.4815C33.9491 29.6368 34.6069 25.7907 35.188 21.9335C35.267 21.3284 35.3565 20.7234 35.4461 20.1181C35.6632 18.651 35.8806 17.1821 35.9485 15.7071C35.7735 14.2351 33.9887 14.5588 32.9955 14.8898C27.8903 16.8324 22.8361 18.919 17.8019 21.0424C17.2316 21.295 16.6535 21.5474 16.0715 21.8015Z" />
              </svg>
              <span>@Timagood</span>
            </a>
          </div>
        </div>
        <footer className={styles.footer}>© 2021 Timur Bayramgulov. All Rights Reserved.</footer>
      </div>
    </MainLayout>
  );
}